app/controllers/sitters_controller.rb

	def results
	  p params[:name]

	  @sitters = Sitter.search(params[:name])
---
SELECT "sitters".* FROM "sitters" LIMIT ?  [["LIMIT", 1]]